import React, { useState } from "react";
import avatar from "../assets/avatar.jpg"; // عکس نماینده

const ChatBox = () => {
  const [userInput, setUserInput] = useState("");
  const [responses, setResponses] = useState([]);

  const handleSend = () => {
    if (userInput.trim()) {
      setResponses([
        ...responses,
        { sender: "user", message: userInput },
        { sender: "bot", message: getResponse(userInput) },
      ]);
      setUserInput("");
    }
  };

  const getResponse = (input) => {
    const responses = {
      سلام: "سلام! خوشحالم که با من صحبت می‌کنید. چطور می‌توانم کمکتان کنم؟",
      "چه خبر؟": "همه چیز خوب است. من همیشه در فکر جبهه و جنگ بودم. شما چطور؟",
      "نام شما چیست؟":
        "من سید مرتضی آوینی هستم. مستندساز و نویسنده‌ای که در دفاع مقدس جانم را فدای میهن کردم.",
      "شهید اوینی کی بود؟":
        "من سید مرتضی آوینی، یکی از شهدای دفاع مقدس ایران هستم. در جنگ ایران و عراق، با ساخت مستندهایی درباره جنگ و انقلاب، سعی کردم حقیقت‌ها را به مردم نشان دهم.",
      "چطور شهید اوینی شهید شد؟":
        "من در سال ۱۳۷۲، وقتی در حال فیلم‌برداری در مناطق جنگی بودم، بر اثر انفجار مین به شهادت رسیدم.",
      "آقای آوینی چه نوع مستندهایی می‌ساخت؟":
        "مستندهایی درباره جنگ ایران و عراق و همچنین فرهنگ و ارزش‌های انقلاب اسلامی می‌ساختم. مهم‌ترین اثر من مستند 'روایت فتح' بود که تأثیر زیادی بر ذهن و قلب مردم گذاشت.",
      "مستندهای شهید آوینی چه تأثیری داشت؟":
        "مستندهای من مردم را با واقعیت‌های جنگ آشنا کرد. من سعی کردم فداکاری‌های رزمندگان را به‌صورت انسانی و با عاطفه به تصویر بکشم.",
      "شهید آوینی چطور به مستندسازی جنگ علاقه‌مند شد؟":
        "من همیشه به تاریخ، فرهنگ و سرنوشت کشورم علاقه داشتم. وقتی جنگ آغاز شد، دیدم که باید از آن چیزی ثبت کنم که در حال وقوع است تا آینده‌گان بدانند چه بر سر این مردم رفته.",
      "آوینی قبل از جنگ چه می‌کرد؟":
        "قبل از جنگ، من نویسنده و شاعر بودم. در زمینه فلسفه و تاریخ نیز تحصیل کرده بودم. به نوعی همیشه در جستجوی حقیقت بودم.",
      "آوینی چه ویژگی‌هایی داشت؟":
        "من همیشه تلاش می‌کردم تا از هنر و سینما برای بیان حقیقت استفاده کنم. صادق بودن و دنبال حقیقت بودن برای من همیشه در اولویت بود.",
      "آوینی چطور شهید شد؟":
        "من در سال ۱۳۷۲ در حین فیلم‌برداری در مناطق عملیاتی جنگ ایران و عراق، بر اثر انفجار مین به شهادت رسیدم.",
      "چرا شهید آوینی مهم است؟":
        "من هیچ‌گاه برای شهرت یا دیده شدن به مستندسازی نپرداختم. هدف من فقط این بود که حقیقت جنگ و انقلاب را به مردم نشان دهم و فداکاری‌های رزمندگان را به یادگار بگذارم.",
      "آیا آوینی در جنگ ایران و عراق تنها مستندساز بود؟":
        "خیر، اما من سعی کردم روایتی متفاوت از جنگ ارائه دهم. جنگ را نه تنها از دید نظامی بلکه از نگاه انسانی به تصویر کشیدم.",
      "آوینی به غیر از مستندسازی، چه کارهایی کرده بود؟":
        "من علاوه بر مستندسازی، نویسنده بودم و در زمینه فرهنگ و تاریخ نیز مطالب زیادی نوشته بودم. من همیشه سعی می‌کردم فرهنگ ایرانی و اسلامی را معرفی کنم.",
      "چگونه می‌توانیم از آثار آوینی بیشتر بدانیم؟":
        "آثار من، به ویژه مستند 'روایت فتح' و کتاب‌های مختلفم می‌تواند برای کسانی که می‌خواهند بیشتر بدانند، مفید باشد.",
      "چه ویژگی‌هایی باعث شهرت آوینی شد؟":
        "من همیشه در پی این بودم که جنگ را از جنبه‌های انسانی و فرهنگی نشان دهم. شاید همین نگاه متفاوت بود که باعث شناخته شدنم شد.",
      "آوینی چگونه در تاریخ سینما و مستندسازی ایران تأثیر گذاشت؟":
        "من به مستندسازی جنگ نگاه جدیدی دادم. همیشه سعی می‌کردم واقعیت‌ها را به مردم نشان دهم و اینطور بود که توانستم تأثیرگذار باشم.",
      "آوینی چه چیزی را در مستندهایش بیشتر نشان می‌داد؟":
        "در مستندهای من، بیشتر روی احساسات و تجربیات انسانی جنگ تأکید شده بود. نه تنها سعی می‌کردم تاریخ را ثبت کنم، بلکه عواطف و رنج‌هایی که جنگ به همراه دارد، نیز نشان می‌دادم.",
      "آوینی چه کسانی را برای مستندسازی انتخاب می‌کرد؟":
        "من بیشتر با رزمندگان و کسانی که در خط مقدم بودند، ارتباط برقرار می‌کردم. آنها بهترین کسانی بودند که می‌توانستند حقیقت جنگ را نشان دهند.",
      "آیا در مستندها خودتان هم حضور داشتید؟":
        "گاهی اوقات در مستندها حضور داشتم، اما بیشتر تمرکزم بر روی روایت داستان‌ها و تجربیات رزمندگان بود. هدفم بیشتر به تصویر کشیدن داستان‌ها از زبان خودشان بود.",
      "آوینی با کدام هنرمندان همکاری داشت؟":
        "من با هنرمندان بسیاری در طول مسیر کاری‌ام همکاری داشتم. همکارانی که همگی در راستای نشان دادن حقیقت جنگ و انقلاب با من همراه بودند.",
      "آوینی چگونه به شهادت رسید؟":
        "من در حین فیلم‌برداری در مناطق عملیاتی در سال ۱۳۷۲، بر اثر انفجار مین به شهادت رسیدم. در لحظه‌های پایانی، هنوز در پی ثبت واقعیت‌های جنگ بودم.",
      "آوینی از چه چیزی بیشتر در مستندهایش حرف می‌زد؟":
        "من بیشتر به مسأله مقاومت، فداکاری و ایثار پرداختم. این که چگونه رزمندگان در دل جنگ همچنان انسانیت و اصول را حفظ می‌کنند.",
      "آوینی چه پیامی برای نسل‌های بعد داشت؟":
        "پیام من این بود که هیچ‌گاه نباید حقیقت‌ها فراموش شوند. باید تاریخ خود را بشناسیم و از تجربیات گذشته برای ساختن آینده استفاده کنیم.",
    };
    return responses[input] || "متاسفم، نمی‌توانم جواب بدهم.";
  };

  return (
    <div className=" w-full p-6 bg-white rounded-lg shadow-lg">
      <div className="max-w-[1000px] flex flex-col justify-between chatbox-container h-[98vh]">
        {/* آواتار (تصویر نماینده سیستم) */}
        <div className="bot-avatar flex justify-center mb-6 mt-4">
          <img
            src={avatar}
            alt="نماینده سیستم"
            className="w-[400px] h-[400px] border-[rgb(151 151 151)] object-cover"
          />
        </div>

        {/* باکس پیام‌ها */}
        <div className="chatbox-messages mb-4 flex-grow overflow-y-auto max-h-[60vh] w-full flex flex-col">
          {responses.map((response, index) => (
            <div
              key={index}
              className={`message p-3 mb-2 rounded-lg w-fit ${
                response.sender === "bot"
                  ? "bg-blue-100 text-blue-900 animate__animated animate__fadeIn mb-12"
                  : "bg-gray-100 text-gray-900 self-end"
              } ${response.sender === "bot" ? "select-text" : ""}`}
              style={{
                animationDuration: "1s",
              }}
            >
              <p>{response.message}</p>
            </div>
          ))}
        </div>

        {/* باکس ورودی و دکمه ارسال */}
        <div className="w-full flex items-center mt-4 space-x-3 gap-1">
          <input
            type="text"
            className="chatbox-input p-3 border-2 border-blue-300 rounded-lg w-full focus:outline-none focus:ring-2 focus:ring-blue-500 transition duration-300 ease-in-out shadow-lg placeholder-gray-500"
            placeholder="سوال خود را بپرسید"
            value={userInput}
            onChange={(e) => setUserInput(e.target.value)}
            onKeyDown={(e) => e.key === "Enter" && handleSend()}
          />
          <button
            onClick={handleSend}
            className="send-button px-6 py-3 bg-gradient-to-r from-blue-500 to-blue-600 text-white rounded-lg hover:from-blue-600 hover:to-blue-500 transition duration-300"
          >
            ارسال
          </button>
        </div>
      </div>
    </div>
  );
};

export default ChatBox;
